In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Columns and row

In [6]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
df[['W','X','Y']]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [86]:
df.W # not recommended

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
df.compound()

W   -9.820840
X    0.385149
Y   -0.893314
Z    2.267004
dtype: float64

In [9]:
df['new']=df['W']+df['X']

In [10]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.drop('new',axis=1 ,inplace=True)

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
# rows

In [15]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [16]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [20]:
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [21]:
df.loc[['A','B'],['W']]

          W
A  2.706850
B  0.651118

In [22]:
df.iloc[[1,2],[2,3]]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001

# Conditional Selection

In [23]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [24]:
df_bool = df>0
df[df_bool]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[df['W']>1]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [26]:
df[df['W']<1]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df[(df['W']>0) & (df['Y']>0) ]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df[df>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B       NaN       NaN
C  0.740122  0.528813
D       NaN       NaN
E  1.978757  2.605967

In [29]:
newdata='my name is negi !'.split()
newdata

['my', 'name', 'is', 'negi', '!']

In [30]:
df['new'] = newdata
df

          W         X         Y         Z   new
A  2.706850  0.628133  0.907969  0.503826    my
B  0.651118 -0.319318 -0.848077  0.605965  name
C -2.018168  0.740122  0.528813 -0.589001    is
D  0.188695 -0.758872 -0.933237  0.955057  negi
E  0.190794  1.978757  2.605967  0.683509     !

In [31]:
# make inplace=True to keep change 
df.reset_index() #level=None', 'drop=False', 'inplace=False', 'col_level=0', "col_fill=''"

  index         W         X         Y         Z   new
0     A  2.706850  0.628133  0.907969  0.503826    my
1     B  0.651118 -0.319318 -0.848077  0.605965  name
2     C -2.018168  0.740122  0.528813 -0.589001    is
3     D  0.188695 -0.758872 -0.933237  0.955057  negi
4     E  0.190794  1.978757  2.605967  0.683509     !

In [32]:
df.set_index('new') #['keys', 'drop=True', 'append=False', 'inplace=False', 'verify_integrity=False'],

             W         X         Y         Z
new
my    2.706850  0.628133  0.907969  0.503826
name  0.651118 -0.319318 -0.848077  0.605965
is   -2.018168  0.740122  0.528813 -0.589001
negi  0.188695 -0.758872 -0.933237  0.955057
!     0.190794  1.978757  2.605967  0.683509

In [33]:
df

          W         X         Y         Z   new
A  2.706850  0.628133  0.907969  0.503826    my
B  0.651118 -0.319318 -0.848077  0.605965  name
C -2.018168  0.740122  0.528813 -0.589001    is
D  0.188695 -0.758872 -0.933237  0.955057  negi
E  0.190794  1.978757  2.605967  0.683509     !

# MULTI INDEX AND INDEX HIERARCHY

In [63]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [64]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [65]:
inside

[1, 2, 3, 1, 2, 3]

In [66]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [70]:
df = pd.DataFrame(data=randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [103]:
df.loc['G1'].iloc[[1,0]]

            A         B
Num
2   -0.031579  0.649826
1    1.025984 -0.156598

In [106]:
df.loc['G1'].iloc[2]['B']

-0.6102588558227414

In [83]:
df.index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [86]:
df.index.names

FrozenList([None, None])

In [87]:
df.index.names = ['Group', 'Num']

In [88]:
df

                  A         B
Group Num
G1    1    1.025984 -0.156598
      2   -0.031579  0.649826
      3    2.154846 -0.610259
G2    1   -0.755325 -0.346419
      2    0.147027 -0.479448
      3    0.558769  1.024810

In [90]:
df.xs(axis=1,key='A')

Group  Num
G1     1      1.025984
       2     -0.031579
       3      2.154846
G2     1     -0.755325
       2      0.147027
       3      0.558769
Name: A, dtype: float64

In [95]:
df.xs(key='G1').iloc[[1,2]]

            A         B
Num
2   -0.031579  0.649826
3    2.154846 -0.610259

In [102]:
df.xs(['G1',1])

A    1.025984
B   -0.156598
Name: (G1, 1), dtype: float64

In [107]:
df.xs(1,level='Num')

              A         B
Group
G1     1.025984 -0.156598
G2    -0.755325 -0.346419